<a href="https://colab.research.google.com/github/Jungsan005/R_statstics/blob/master/%EB%8D%B0%EC%9D%B4%ED%84%B0%ED%94%84%EB%A0%88%EC%9E%84_%EB%8B%A4%EB%A3%A8%EA%B8%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [20]:
# 매니저 평점 분석
Manager <- c("1","2","3","4","5")
Date <- c("2014-10-24", "2014-10-28", "2014-10-01", "2014-10/12","2014-05-01")
Country <- c("US","US", "UK",  "UK", "UK")
Gender <- c("M","F","F","M","F")
Age <- c(32,45,25,39,99)
q1 <- c(5,3,3,3,2)
q2 <- c(4,5,5,3,2)
q3 <- c(5,2,5,4,1)
q4 <- c(5,5,5,NA,2)
q5 <- c(5,5,2,NA,1)


managers <- data.frame(Manager,Date, Country, Gender, Age, q1, q2, q3, q4, q5)

In [59]:
managers

  Manager Date       Country Gender Age q1 q2 q3 q4 q5 ages
1 1       2014-10-24 US      M      32  5  4  5   5  5 중년
2 2       2014-10-28 US      F      45  3  5  2   5  5 중년
3 3       2014-10-01 UK      F      25  3  5  5   5  2 청년
4 4       2014-10/12 UK      M      39  3  3  4  NA NA 중년
5 5       2014-05-01 UK      F      99  2  2  1   2  1 노년

In [16]:
# 나이라는 컬럼을 기준으로 age3s라는 새로운 컬러 생성

# age: 연속형 => ages: 범주형
# 나이 20 ~ 30: 청년
# 나이 31 ~ 45: 중년
# 나이 46 ~ 65: 장년
# 나이 66 ~   : 노년

# managers$새로운 컬럼 명 <- 값
# 데이터프레임에 존재하지 않는 컴럼을 명시하면 그 이름으로 새롭게 추가됨

managers$ages <- c(0,0,0,0,0) # 나이대 컬럼

# 데이터프레임 요소 접근하기
# 2차원배영릐 일종이므로 배열요소 접근방식 사용
# 데이터프레임[행, 열]

managers[1,1] # 매니저 번호 중 1번 출력
managers[1,'Country'] # 1번 매니저 국적
managers[1,c('Country','Gender')] 
managers[1,c(3,4)] 
managers[c(2,4), c(3,4)]
managers[3,1:10]
managers[3,]
managers[,5]

[1] 1
Levels: 1 2 3 4 5

[1] US
Levels: UK US

  Country Gender
1 US      M

  Country Gender
1 US      M

  Country Gender
2 US      F
4 UK      M

  Manager Date       Country Gender Age q1 q2 q3 q4 q5
3 3       2014-10-01 UK      F      25  3  5  5  5  2

  Manager Date       Country Gender Age q1 q2 q3 q4 q5 ages
3 3       2014-10-01 UK      F      25  3  5  5  5  2  0

[1] 32 45 25 39 99

In [25]:
# 불리언(boolean) 인덱싱
# 특정 조건을 만족하는 데이터를 찾을 수 있음
# 데이터프레임[조건식]

managers$Gender == "M"

managers[managers$Gender=="M",]

[1]  TRUE FALSE FALSE  TRUE FALSE

  Manager Date       Country Gender Age q1 q2 q3 q4 q5
1 1       2014-10-24 US      M      32  5  4  5   5  5
4 4       2014-10/12 UK      M      39  3  3  4  NA NA

In [36]:
managers[managers$Age > 40,]

  Manager Date       Country Gender Age q1 q2 q3 q4 q5
2 2       2014-10-28 US      F      45  3  5  2  5  5
5 5       2014-05-01 UK      F      99  2  2  1  2  1

In [44]:
managers[managers$Age < 30 & managers$Gender == 'F', 'Country']

[1] UK
Levels: UK US

In [41]:
cnd <- managers$Age < 30 & managers$Gender == 'F'
managers[cnd, 'Country']

[1] UK
Levels: UK US

In [55]:
# 청년
cnd <- managers$Age > 20 & managers$Age <= 30
managers$ages[cnd] <- '청년'

In [56]:
# 중년
cnd <- managers$Age > 31 & managers$Age <= 45
managers$ages[cnd] <- '중년'

In [57]:
# 장년
cnd <- managers$Age > 46 & managers$Age <= 65
managers$ages[cnd] <- '장년'

In [58]:
# 노년
cnd <- managers$Age > 66
managers$ages[cnd] <- '노년'

In [71]:
managers

  Manager Date       Country Gender Age q1 q2 q3 q4 q5 ages
1 1       2014-10-24 US      M      32  5  4  5   5  5 중년
2 2       2014-10-28 US      F      45  3  5  2   5  5 중년
3 3       2014-10-01 UK      F      25  3  5  5   5  2 청년
4 4       2014-10/12 UK      M      39  3  3  4  NA NA 중년
5 5       2014-05-01 UK      F      99  2  2  1   2  1 노년b

In [ ]:
# 조건식이 둘 이상인 경우 쓸데없이 코드가 길어지고
# 가독성도 떨어짐 -> attach, with, within

In [68]:
with(managers, ages[Age > 66] <- '노년a')
# 특정컬럼 수정 불가
managers

  Manager Date       Country Gender Age q1 q2 q3 q4 q5 ages
1 1       2014-10-24 US      M      32  5  4  5   5  5 중년
2 2       2014-10-28 US      F      45  3  5  2   5  5 중년
3 3       2014-10-01 UK      F      25  3  5  5   5  2 청년
4 4       2014-10/12 UK      M      39  3  3  4  NA NA 중년
5 5       2014-05-01 UK      F      99  2  2  1   2  1 노년

In [72]:
managers <- within(managers, ages[Age > 66] <- '노년b')
managers
# 수정결과를 반영하려면 within 함수 결과를 
# 데이터프레임 변수에 저장해야 함

  Manager Date       Country Gender Age q1 q2 q3 q4 q5 ages
1 1       2014-10-24 US      M      32  5  4  5   5  5 중년
2 2       2014-10-28 US      F      45  3  5  2   5  5 중년
3 3       2014-10-01 UK      F      25  3  5  5   5  2 청년
4 4       2014-10/12 UK      M      39  3  3  4  NA NA 중년
5 5       2014-05-01 UK      F      99  2  2  1   2  1 노년b

In [73]:
# within 함수를 이용해서 ages2컬럼에 
# 나이별 범주값 저장하는 코드 재작성
managers$ages2 <- c(0,0,0,0,0) # 나이대 컬럼

In [79]:
within(managers,{
       ages2[Age <= 30] <- '청년b'
       ages2[Age >= 31] <- '중년b'
       ages2[Age >= 46] <- '장년b'
       ages2[Age >= 66] <- '노년b'
})

  Manager Date       Country Gender Age q1 q2 q3 q4 q5 ages  ages2
1 1       2014-10-24 US      M      32  5  4  5   5  5 중년  중년b
2 2       2014-10-28 US      F      45  3  5  2   5  5 중년  중년b
3 3       2014-10-01 UK      F      25  3  5  5   5  2 청년  청년b
4 4       2014-10/12 UK      M      39  3  3  4  NA NA 중년  중년b
5 5       2014-05-01 UK      F      99  2  2  1   2  1 노년b 노년b

In [82]:
managers <- within(managers,{
       ages2[Age > 20 & Age <= 30] <- '청년a'
       ages2[Age > 31 & Age <= 45] <- '중년a'
       ages2[Age > 46 & Age <= 65] <- '장년a'
       ages2[Age > 66] <- '노년a'
})

In [83]:
managers

  Manager Date       Country Gender Age q1 q2 q3 q4 q5 ages  ages2
1 1       2014-10-24 US      M      32  5  4  5   5  5 중년  중년a
2 2       2014-10-28 US      F      45  3  5  2   5  5 중년  중년a
3 3       2014-10-01 UK      F      25  3  5  5   5  2 청년  청년a
4 4       2014-10/12 UK      M      39  3  3  4  NA NA 중년  중년a
5 5       2014-05-01 UK      F      99  2  2  1   2  1 노년b 노년a

In [100]:
# 설문문항 컬럼의 총합과 평균을 구해서
# sumq, meanq라는 컬럼 생성
# 단, NA는 0으로 대체함!
managers[4,9] <- 0
managers[4,10] <- 0

In [97]:
managers$sumq <- c(0,0,0,0,0) # 총합
managers$meanq <- c(0,0,0,0,0) # 평균

In [98]:
managers

  Manager Date       Country Gender Age q1 q2 q3 q4 q5 ages  ages2 sumq meanq
1 1       2014-10-24 US      M      32  5  4  5   5  5 중년  중년a 0    0
2 2       2014-10-28 US      F      45  3  5  2   5  5 중년  중년a 0    0
3 3       2014-10-01 UK      F      25  3  5  5   5  2 청년  청년a 0    0
4 4       2014-10/12 UK      M      39  3  3  4  NA NA 중년  중년a 0    0
5 5       2014-05-01 UK      F      99  2  2  1   2  1 노년b 노년a 0    0

In [93]:
managers$sumq <- managers$q1+managers$q2+managers$q3+managers$q4+managers$q5

In [95]:
managers$meanq <- managers$sumq /5

In [103]:
managers <- within(managers,{
       sumq <- q1+q2+q3+q4+q5
       meanq <- sumq/5
})
managers

  Manager Date       Country Gender Age q1 q2 q3 q4 q5 ages  ages2 sumq meanq
1 1       2014-10-24 US      M      32  5  4  5  5  5  중년  중년a 24   4.8
2 2       2014-10-28 US      F      45  3  5  2  5  5  중년  중년a 20   4.0
3 3       2014-10-01 UK      F      25  3  5  5  5  2  청년  청년a 20   4.0
4 4       2014-10/12 UK      M      39  3  3  4  0  0  중년  중년a 10   2.0
5 5       2014-05-01 UK      F      99  2  2  1  2  1  노년b 노년a  8   1.6